# CantKeepConstraintsToBars Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..RebarCouplerFailures..::..CantKeepConstraintsToBars Property
BuiltInFailures..::..RebarCouplerFailures Class See Also
---
The constraints between the coupler and the two connected bars are no longer satisfied. Post error to delete the coupler.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CantKeepConstraintsToBars { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CantKeepConstraintsToBars As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CantKeepConstraintsToBars {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..RebarCouplerFailures Class
Autodesk.Revit.DB Namespace